---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookTypen2
source: html/16414754-a7f8-2852-49ce-3670b586603e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookTypen2 Property

"Alternating Bar - End Hook Type"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinEndHookTypen2 { get; }
```